using Task2And3;

class Program
{
    static void Main()
    {
        string[] content = {
            "Крізь сотні сумнівів я йду до тебе",
            "Добро і правдо віку. Через сто",
            "Зневір. Моя душа, запрагла неба,",
            "В буремнім леті держить путь на стовп",
            "Високого вогню, що осіянний",
            "Одним твоїм бажанням. Аж туди,",
            "Де не лягали ще людські сліди,",
            "З щовба на щовб, аж поза смертні грані",
            "Людських дерзань, за чорну порожнечу,",
            "Де вже нема ні щастя, ні біди.",
            "I врочить порив: не спиняйся, йди,",
            "То — шлях правдивий. Ти — його предтеча."
        };   
        Book book = new Book(content);
        FindAndReplaceManager.FindNext("Де вже нема ні щастя, ні біди.", book);
        FindAndReplaceManager.FindNext("То — шлях правдивий. Ти — його предтеча.", book);

        Notes notes = new Notes();
        notes.AddNote("Постійно забуваю 10 строку.");
        notes.AddNote("Хочу вивчити 10 та 12 строку.");
        notes.AddNote("Вивчила 10 та 12 строку.");
        //notes.DeleteNote(2);
        
        notes.DisplayNotes();

        Console.ReadKey();
    }
}